app/views/mp3s/show.html.erb

SELECT `ratings`.* FROM `ratings` WHERE (`ratings`.mp3_id = 1)
---

  <% @mp3.ratings.each do |rating| %>