app/controllers/mp3s_controller.rb

SELECT `mp3s`.* FROM `mp3s`
---
  def index
    @mp3s = Mp3.all

SELECT `mp3s`.* FROM `mp3s` WHERE `mp3s`.`id` = 1 LIMIT 1
---
  def show
    @mp3 = Mp3.find(params[:id])

SELECT `mp3s`.* FROM `mp3s` WHERE `mp3s`.`id` = 6 LIMIT 1
---
  def edit
    @mp3 = Mp3.find(params[:id])

INSERT INTO `mp3s` (`url`, `title`, `artist_name`, `length`, `created_at`, `updated_at`) VALUES ('/MyMusic/mp3/sample1.mp3', 'Dazed and Confused', 'Led Zeppelin', 367, '2011-05-13 13:23:11', '2011-05-13 13:23:11')
---
  def create
    @mp3 = Mp3.new(params[:mp3])

    respond_to do |format|
      if @mp3.save

SELECT `mp3s`.* FROM `mp3s` WHERE `mp3s`.`id` = 6 LIMIT 1
UPDATE `mp3s` SET `title` = 'New Ending', `updated_at` = '2011-05-13 13:23:13' WHERE `mp3s`.`id` = 6
---
  def update
    @mp3 = Mp3.find(params[:id])

    respond_to do |format|
      if @mp3.update_attributes(params[:mp3])

SELECT `mp3s`.* FROM `mp3s` WHERE `mp3s`.`id` = 1 LIMIT 1
DELETE FROM `mp3s` WHERE `mp3s`.`id` = 1
---
  def destroy
    @mp3 = Mp3.find(params[:id])
    @mp3.destroy