app/controllers/playlist_controller.rb

  def index
    @mp3s = Mp3.all
---
SELECT `mp3s`.* FROM `mp3s`

  def new
     @artists = Mp3.all.map(&:artist_name).uniq.sort
---
SELECT `mp3s`.* FROM `mp3s`

  def create
    @mp3s = [];
    rating = params[:rating][:value]
    artist = params[:artist][:name]

    Mp3.joins(:ratings).where( :mp3s => { :artist_name => artist } ).each { |i| @mp3s << i if i.average_rating >= rating.to_i }
---
SELECT `mp3s`.* FROM `mp3s` INNER JOIN `ratings` ON `ratings`.`mp3_id` = `mp3s`.`id` WHERE `mp3s`.`artist_name` = 'artist_2'