app/controllers/ratings_controller.rb

  def create
      @mp3 = Mp3.find(params[:mp3_id])
      @rating = @mp3.ratings.create(params[:rating])
---
SELECT `mp3s`.* FROM `mp3s` WHERE `mp3s`.`id` = 1 LIMIT 1
INSERT INTO `ratings` (`user`, `value`, `mp3_id`, `created_at`, `updated_at`) VALUES ('Angela', 3, 1, '2011-05-13 13:23:09', '2011-05-13 13:23:09')